package ex4_class;

public class Ex1_class {
	public static void main(String[] args) {
		
		
		//객체지향 프로그래밍
		//객체를 중심으로 프로그램구조를 설계하고 프로그래밍 하는것을 객체 지향 프로그래밍이라고한다.
		//객체는 상태를 표현할 수 있고, 행동으로 실행할 수 있는 모든것들을 의미한다.
		
		//클래스란?
		//객체를 생성하기 위한 설명서
		//클래스의 기반으로 객체를 생성한다.
		//하나의 설명서로 여러개의 물건을 만들 수  있듯 이 하나의 클래스로 여러개의 객체를 만들 수 있다.
		
		//클래스의 종류
		//-실행용 클래스 : 프로그램 전체에 단 하나의 클래스로, 프로그램의 실행을 맡고있다.
		// main매서드(JVM을 찾아서 실행)를 갖고 있으며, 다른 클래스에서 사용하지 않는다.
		//-참조용 클래스(객체 생성용 클래스):다른 클래스에서 사용할 목적으로 선언되는 클래스
		
		//하나의 클래스가 위 두가지 용도의 역할을 모두 수행할 수 있다.
		//하지만 유지보수와 객체지향 프로그래밍의 특징인 모듈화를 고려해 별도로 분리하여 작성하는것이 좋다.
		//일반적으로 하나의 프로그램에서 실행용 클래스1개를 제외하면 나머지 클래스는 모두 참조용 클래스이다.
		
		
		//클래스의 선언
		//접근제한자 class 클래스명{}
		//클래스명을 작성하는 규칙 : 영어대소문자를 사용할 수 있으며, 첫글자는 대문자를 사용한다.
		//숫자를 사용할 수 있으나 첫글자로는 사용할 수 없다.
		//특수문자는 $,_만 사용할 수 있다.
		//예약어는 사용할 수 없다.
		
	}
}
